Autodesk.Revit.DB.FailureMessage.SetAdditionalElements(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the additional reference elements for the failure.
Remarks:
Additional elements are used to highlight additional information to the user. They are not
considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
additionalElements:
The additional elements.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetFailingElements(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets elements that have caused the failure.
Remarks:
In the Revit error dialog these elements will be highlighted to the user and can be deleted by user via extended error dialog.
idsToShow:
The elements that have caused the failure.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011